ams/src/Documents/AMS_ПередачаВПереработку/AMS_ПередачаВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ПередачаВПереработку</name>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister._ТоварыПереданные</registerRecords>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчикаЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчикаЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef._ВозвратИзПереработки</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеТоваров</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ВидТранспортаПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ДоверенностьКлиента</name>
    <comment>1 - Оригинал, 2 - Копия</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_НомерЗаявкиПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ТелефонВодителяКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ТранспортКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/AccumulationRegisters/_ТоварыПереданные/_ТоварыПереданные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>_ТоварыПереданные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef._ВозвратИзПереработки</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ams/src/Enums/AMS_ОперацииПроизводства/AMS_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_ОперацииПроизводства</name>
  <enumValues>
    <name>ПеремещениеМатериаловВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоФабрикатов</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукции</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>СписаниеФабрикатаСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеБракаВЦех</name>
    <comment>Перемещение брака в цех (из склада бракованной продукции)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеБракаВЦехе</name>
  </enumValues>
  <enumValues>
    <name>СписаниеБракаВЦехеОрдер</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеМатериаловИзБрака</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеМатериаловИзБракаОрдер</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловНаПереработкуБрака</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловБракаВОтходы</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловНаПереработкуБрака</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеПроизведеннойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукцииИзБрака</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоФлаконов</name>
  </enumValues>
  <enumValues>
    <name>ПриемИзПереработки</name>
    <comment>Прием из переработки (давальческого сырья)</comment>
  </enumValues>
</mdclass:Enum>

ams/src/Documents/AMS_ПередачаВПереработку/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование") = "Эстервуд" Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();

	Попытка

		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ОформитьДокументПеремещениеТоваров(Отказ);

		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			ОтменитьПроведение(Отказ);
		КонецЕсли;

		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Товары.Ссылка.Дата КАК Период,
	|	Товары.Ссылка.Партнер КАК Партнер,
	|	Товары.Ссылка.Контрагент КАК Контрагент,
	|	Товары.Ссылка.Основание КАК ДокументПоступления,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество
	|ИЗ
	|	Документ.AMS_ПередачаВПереработку.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Движения._ТоварыПереданные.Записывать = Истина;
	Движения._ТоварыПереданные.Загрузить(Рез.Выгрузить());
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		ЗаполнитьПоПоступлению(ДанныеЗаполнения);
	Иначе
		Ответственный = Пользователи.АвторизованныйПользователь()
	КонецЕсли;
	
	Организация = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();
	Склад = AMS_ВызовСервера.СкладКомпании();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОформитьДокументПеремещениеТоваров(Отказ)
	УстановитьПривилегированныйРежим(Истина);

	Если ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
		Док = ПеремещениеТоваров.ПолучитьОбъект();
	Иначе
		Док = Документы.ПеремещениеТоваров.СоздатьДокумент();
	КонецЕсли;

	Если Док.ПометкаУдаления <> ПометкаУдаления Тогда
		мср.УстановитьПометкуУдаленияДокументу(Док, ПометкаУдаления, Отказ);
	КонецЕсли;

	Док.Дата                  = Дата;
	Док.ВидЦены               = Справочники.Склады.УчетныйВидЦены(Склад);
	Док.Организация           = Организация;
	Док.Ответственный         = Ответственный;
	Док.Автор                 = Ответственный;
	Док.Подразделение         = Справочники.СтруктураПредприятия.НайтиПоКоду("01-000002"); //Цех 1
	Док.СкладОтправитель      = Склад;
	Док.СкладПолучатель       = AMS_ВызовСервера.СкладКомпании();
	Док.Статус                = Перечисления.СтатусыПеремещенийТоваров.Принято;
	Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	Док.СпособДоставки        = Перечисления.СпособыДоставки.Самовывоз;
	Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	Док.Комментарий           = "Сформирован автоматичестки. Оформление передачи на переработку (на склад компании). Передача в переработку № "
		+ Номер + " от " + Формат(Дата, "ДЛФ=Д") + " г.";

	Док._ОперацияПроизводства = Перечисления.AMS_ОперацииПроизводства.ПеремещениеМатериаловВПереработку;
	Док._Основание            = Ссылка;

	Табл = Док.Товары;
	Табл.Очистить();
	Для Каждого Стр Из Товары Цикл
		НовСтр = Табл.Добавить();
		НовСтр.Номенклатура       = Стр.Номенклатура;
		НовСтр.Количество         = Стр.Количество;
		НовСтр.КоличествоУпаковок = Стр.Количество;
	КонецЦикла;

	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);

	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось записать документ перемещения продукции на склад.");
	Иначе
		ПеремещениеТоваров = Док.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоПоступлению(Основание)
	Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация,Склад,Менеджер");

	Организация   = Стр.Организация;
	Склад         = Стр.Склад;
	Ответственный = Стр.Менеджер;

	Товары.Очистить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Основание);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.Номенклатура.Наименование";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтр = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ОтменитьПроведение(Отказ)
	Если ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
		Если ПометкаУдаления Тогда
			мср.УстановитьПометкуУдаленияДокументу(ПеремещениеТоваров, Истина, Отказ);

		ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПеремещениеТоваров, "Проведен") Тогда
			мср.ЗаписатьДокумент(ПеремещениеТоваров, РежимЗаписиДокумента.ОтменаПроведения, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
